import React from "react";
import Layout from "../../components/rtl/layout/Layout";
import katwalkBag from "../../assets/images/designers/katwalk-bag.jpg";
import Features from "../../components/rtl/features/Features";
import HeadingAndText from "../../components/rtl/heading-and-text/HeadingAndText";
import { useEffect } from "react";
function FAQ() {
  useEffect(() => {
    document.querySelector("body").style.direction = "rtl";
  }, []);

  const FAQ_Content = [
    {
      title: "عن كات ووك",
    },
    {
      title: "من كات ووك؟",
      content: [
        {
          type: "paragraph",
          text: [
            "كات ووك مفهوم عصري ومختلف في ربط المصمّمات ذوات الخبرة المبدعات مع محبي الموضة. تقود كات ووك التحوّل في الأزياء العربية؛ من خلال تقديم خدمات متكاملة تساعد المصممات الموهوبات على إحداث تأثيرٍ يساهم في تشكيل مستقبل الأزياء العربية.",
          ],
        },
      ],
    },
    {
      title: "ما هي تصاميم بيسبوك؟",
      content: [
        {
          type: "paragraph",
          text: [
            "نقدّم تصاميم بيسبوك الحصرية لتوفير التجربة الشخصية المطلقة للقِطَع المُصمَّمة خصيصًا لمن يبحثن عن قِطَع فريدة تتناسب مع ذوقهن ومقاساتهن بدقة. خدمة بيسبوك تُكمّل مظهرك بمجموعة حصرية متنوعة من الألوان والخصائص والأشكال؛ لمنحك التجربة التي طالما رغبت بها.",
          ],
        },
      ],
    },
    {
      title: "هل تقوم كات ووك بتصميم المنتجات؟",
      content: [
        {
          type: "paragraph",
          text: [
            "كات ووك منصة تسوق إلكترونية تربط المصمّمات ذوات الخبرة والناشئات المبدعات مع محبّي الموضة.",
          ],
        },
      ],
    },
    {
      title: "كيف بإمكاني البيع في كات ووك؟",
      content: [
        {
          type: "paragraph",
          text: ["كوني جزءًا من مستقبل الأزياء العربية عن طريق زيارة"],
        },
        {
          type: "anchor",
          text: "https://4v3p9b7mvnx.typeform.com/joinkatwalk",
        },
      ],
    },
    {
      title: "الشحن والتوصيل",
      content: [
        {
          type: "paragraph",
          text: [
            "ماهي الدول التي يتم الشحن إليها؟",
            "نشحن لجميع مدن المملكة في الوقت الحالي.",
          ],
        },
      ],
    },
    {
      title: "كم يوم يستغرق توصيل طلبي؟",
      content: [
        {
          type: "paragraph",
          text: [
            "- القطع الجاهزة تستغرق يومين للتسليم إلى الناقل والقطع المفصلة حسب التصميم والمقاس تستغرق ١٠-١٤ يوم للتسليم إلى الناقل",
            "- يتم تسليم الطلبات إلى الناقل الحصري أرامكس ويستغرق المدة التالية",
          ],
        },
        {
          type: "table",
          tableHead: [
            "الموقع",
            "المدة الزمنية	",
            "تكلفة الشحن",
          ],
          tableBody: [
            {
              rowData: [
                "	المشتري والبائع في بلد واحد",
                "2-٥ أيام عمل",
                "مجاناً",

              ],

            },


            {
              rowData: [
                "المشتري في بلد مختلف عن البائع",
                "٦-١٠ أيام عمل",
                "على المشتري",

              ],
            },
          ],
        },
        {
          type: "paragraph",
          text: [
            "- هذا الجدول مجرد تقدير زمني للتسليم، والبائعين لدينا يبذلون قصارى جهودهم لتسليم الطلبات الخاصة بكِ في الوقت المحدد.",

            "- يرجى ملاحظة أنه قد يكون هناك بعض التأخير خلال مواسم الذروة والترويج والعطلات",
            "- من المتوقع أن تدفع أي طلبات نقدية عند التسليم 20 ريال سعودي للشحن المحلي",
            "- عندما يتم وضع طلبكِ للتسليم سيتم الاتصال بكِ من قبل الناقل لتأكيد موقعك والوقت. يرجى ملاحظة أن لديك فقط 3 محاولات لاستلام الطلب قبل إلغاء طلبكِ أو سيتم تطبيق رسوم إضافية.",
          ],
        },
      ],
    },
    {
      title: "كيف يمكنني تتبع شحنتي؟",
      content: [
        {
          type: "paragraph",
          text: ["يمكنكِ تتبع شحنتكِ عبر حسابي > طلباتي"],
        },
      ],
    },
    {
      title: "الطلب",
    },
    {
      title: "كيف يمكنني التواصل مع خدمة العملاء؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ التواصل مع خدمة العملاء عن طريق زيارة: katwalk.sa/contact",
          ],
        },
      ],
    },
    {
      title: "هل يمكنني الطلب عبر WhatsApp؟",
      content: [
        {
          type: "paragraph",
          text: [
            "جميع الطلبات تتم عبر موقعنا الإلكتروني فقط. بإمكانكِ التواصل معنا عن طريق WhatsApp للحصول على أيّ مساعدة.",
          ],
        },
      ],
    },
    {
      title: "كيف سيتم إعلامي أن طلبي مقبول؟",
      content: [
        {
          type: "paragraph",
          text: [
            "بمجرد قبول الطلب/رفضه، سيتم إرسال إشعار تأكيد عبر الرسائل القصيرة أو البريد الإلكتروني أو عبر تطبيق WhatsApp. تستغرق الطلبات ما يصل إلى يوم عمل حتى يتم قبولها مِن قِبَل المصممة",
          ],
        },
      ],
    },
    {
      title: "هل يمكنني تغيير طلبي أو تعديله أو إلغاؤه؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ ذلك فقط في حال عدم تأكيد طلبكِ من قِبَل المصممة.",
            "بإمكانكِ تتبع حالة الطلب عبر حسابي > طلباتي",
            "في حال كانت حالة طلبكِ غير مؤكدة، يمكنكِ تغيير، تعديل أو إلغاء طلبكِ من خلال التواصل مع خدمة العملاء عن طريق زيارة:  katwalk.sa/contact",
          ],
        },
        {
          type: "paragraph_sm",
          text: [
            "يُرْجَى ملاحظة أنه وفقًا لقانون التجارة الإلكترونية في المملكة العربية السعودية، لا يمكن إرجاع القطع المفصّلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك)",
          ],
        },
      ],
    },
    {
      title: "أعطيت قياسات خاطئة، ماذا أفعل؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ ذلك فقط في حال عدم تأكيد طلبكِ من قِبَل المصممة.",
            "بإمكانكِ تتبع حالة الطلب عبر حسابي > طلباتي",
            "في حال كانت حالة طلبكِ غير مؤكدة، يمكنكِ تغيير، تعديل أو إلغاء طلبكِ من خلال التواصل مع خدمة العملاء عن طريق زيارة:  katwalk.sa/contact",
          ],
        },
        {
          type: "paragraph_sm",
          text: [
            "يُرْجَى ملاحظة أنه وفقًا لقانون التجارة الإلكترونية في المملكة العربية السعودية، لا يمكن إرجاع القطع المفصّلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك)",
          ],
        },
      ],
    },
    {
      title: "لم أستلم طلبي، ماذا أفعل؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ ذلك فقط في حال عدم تأكيد طلبكِ من قِبَل المصممة. ",
            "بإمكانكِ تتبع حالة الطلب عبر حسابي > طلباتي",
            "في حال كانت حالة طلبكِ غير مؤكدة، يمكنكِ تغيير، تعديل أو إلغاء طلبكِ من خلال التواصل مع خدمة العملاء عن طريق زيارة:  katwalk.sa/contact يُرْجَى ملاحظة أنه وفقًا لقانون التجارة الإلكترونية في المملكة العربية السعودية، لا يمكن إرجاع القطع المفصّلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك)",
          ],
        },
      ],
    },
    // {
    //   title: "Bespoke and Sizing",
    // },
    {
      title: "لم أستلم طلبي، ماذا أفعل؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ تتبع الطلب عبر حسابي > طلباتي ",
            "في حالة وجود خطأ أو عدم مقدرتكِ على تتبع الطلب، يرجى التواصل مع خدمة العملاء عن طريق زيارة: katwalk.sa/contact",
          ],
        },
      ],
    },

    {
      title: "استلمت طلبًا خاطئًا/تالفًا، ماذا أفعل؟",
      content: [
        {
          type: "paragraph",
          text: [
            "نعتذر على ذلك! إذا كنتِ قد تلقيتِ طلبكِ وكان تالفًا أو غير صحيح، سيكون طلبكِ مؤهل للاسترجاع المجاني عن طريق زيارة: katwalk.sa/contact واختيار طريقة الاتصال المفضلة لديكِ، وذلك خلال ٧ أيام من استلام الطلب.",
          ],
        },
      ],
    },

    {
      title: "كيف يمكنني مشاركة تجربتي مع كات ووك؟      ",
      content: [
        {
          type: "paragraph",
          text: [
            "نسعد لسماع رأيكِ!",
            "يمكنكِ تعبئة استبيان كات ووك عن طريق زيارة: https://4v3p9b7mvnx.typeform.com/katwalksurvey",
            "أو التواصل مع خدمة العملاء عن طريق زيارة: katwalk.sa/contact",
          ],
        },
      ],
    },

    {
      title: "بيسبوك والمقاسات",
      content: [
        {
          type: "paragraph",
        },
      ],
    },

    {
      title: "ماهي تصاميم بيسبوك؟",
      content: [
        {
          type: "paragraph",
          text: [
            "نقدّم تصاميم بيسبوك الحصرية لتوفير التجربة الشخصية المطلقة للقِطَع المُصمَّمة خصيصًا لمن يبحثن عن قِطَع فريدة تتناسب مع ذوقهن ومقاساتهن بدقة. خدمة بيسبوك تُكمّل مظهرك بمجموعة حصرية متنوعة من الألوان والخصائص والأشكال؛ لمنحك التجربة التي ترغبين بها.",
          ],
        },
      ],
    },

    {
      title: "كيف يمكنني معرفة مقاسي؟",
      content: [
        {
          type: "paragraph",
          text: ["جدول المقاسات أدناه سيساعدكِ في تحديد المقاس!"],
        },
        {
          type: "table",
          tableHead: [
            "طول الكم (إنش)	",
            "العرض (إنش)	",
            "طول القطعة (إنش)	",
            "طولكِ (سم)	",
            "المقاس",
          ],
          tableBody: [
            {
              rowData: ["٢٥", "٢٠", "٥٠", "١٤٦-١٥٠", "٥٠"],
            },
            {
              rowData: ["٢٦", "٢٢", "٥٢", "١٥٢-١٥٤", "٥٢"],
            },
            {
              rowData: ["٢٧", "٢٣", "٥٤", "١٥٧-١٦٠", "٥٤"],
            },
            {
              rowData: ["٢٨", "٢٥", "٥٦", "١٦٢-١٦٥	", "٥٦"],
            },
            {
              rowData: ["٢٩", "٢٦", "٥٨", "١٦٧-١٧٠	", "٥٨"],
            },
            {
              rowData: ["٣٠	", "٢٨", "٦٠", "١٧٢-١٧٥	", "٦٠"],
            },
          ],
        },
        {
          type: "paragraph",
          text: [
            ".نرجو ملاحظة أن القياسات المذكورة أعلاه هي قياسات القطعة، وليست قياسات جسمكِ*",
            ".قد تختلف بعض القطع عن هذه القياسات نظرًا لاختلاف الأقمشة والقصات والمصممات، ولكن بإمكانكِ استخدامها كمرجع**",
            ".إذا كنتِ ترغبين بارتداء عباية أقل من طول كعب القدم، فننصحكِ بطلب مقاس واحد أصغر مما هو موصى به لطولكِ***",
          ],
        },
      ],
    },

    {
      title: "كيف يمكنني أخذ مقاساتي بشكل صحيح؟",
      content: [
        {
          type: "paragraph",
          text: ["نرجو الاطلاع على جدول المقاسات الموجود في صفحة المنتج."],
        },
      ],
    },
    {
      title: "الاسترجاع والمبالغ المستردة",
    },
    {
      title: "كيف يمكنني استرجاع طلبي؟",
      content: [
        {
          type: "paragraph",
          text: [
            "إذا كنتِ ترغبين في استرجاع طلبكِ، يرجى زيارة: ",
            "واختيار طريقة الاتصال المفضلة لديكِ، وسوف نعود إليكِ في أقرب وقت ممكن",
            "- القطع الجاهزة قابلة للاسترجاع في خلال ٧ أيام من استلام الطلب.",
            "- يجب أن تكون المنتجات جديدة وغير مستخدمة وبحالتها الأصلية مع جميع الملصقات المرفقة إن وُجِدَتْب.",
          ],
        },
      ],
    },
    {
      title: "ما هي رسوم الشحن والإرجاع؟",
      content: [
        {
          type: "paragraph",
          text: [
            "العميل هو المسؤول عن تكاليف الاسترجاع للناقل.",
            " إذا كنتِ قد تلقيت طلبكِ، وكان تالفًا أو غير صحيح، سيكون طلبكِ مؤهل للاسترجاع المجاني عن طريق زيارة: واختيار طريقة الاتصال المفضلة لديكِ وذلك خلال ٧ أيام من استلام الطلب",
          ],
        },
      ],
    },
    {
      title: "كم يومًا لدي لاسترجاع المنتج؟",
      content: [
        {
          type: "paragraph",
          text: [
            "تتبع كات ووك أنظمة التجارة الإلكترونية في المملكة العربية السعودية.",
            "- القطع الجاهزة قابلة للاسترجاع خلال ٧ أيام من استلام الطلب.",
            "- المنتجات غير القابلة للاسترجاع: القطع المفصلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك)",
            "- يجب أن تكون المنتجات جديدة وغير مستخدَمة، وبحالتها الأصلية، مع جميع الملصقات المرفقة إن وُجِدَتْ",
          ],
        },
      ],
    },
    {
      title: "ماهي المنتجات القابلة للاسترجاع؟",
      content: [
        {
          type: "paragraph",
          text: [
            "تتبع كات ووك أنظمة التجارة الإلكترونية في المملكة العربية السعودية",
            "- القطع الجاهزة قابلة للاسترجاع خلال ٧ أيام من استلام الطلب.",
            "- المنتجات غير القابلة للاسترجاع: القطع المفصلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك)",
            "- يجب أن تكون المنتجات جديدة، وغير مستخدَمة، وبحالتها الأصلية، مع جميع الملصقات المرفقة إن وُجِدَتْ",
          ],
        },
      ],
    },

    {
      title: "كيف يمكنني استرداد المبلغ؟",
      content: [
        {
          type: "paragraph",
          text: [
            "سيتم استرداد المبلغ بعد الفحص والموافقة على المنتج/المنتجات التي تم إرجاعها",
            "- المنتجات المسترجعة، سيتم استرداد مبلغ المنتج بما في ذلك ضريبة القيمة المضافة (باستثناء رسوم الدفع عند التسليم). سيكون العميل مسؤولاً عن تكاليف إرجاع الناقل",
            "- بالنسبة للمنتجات التالفة/غير الصحيحة، سيتم رد المبلغ المدفوع بالكامل. بما في ذلك، إن وُجِدَ، رسوم الدفع عند التسليم ولن يكون العميل مسؤولاً عن تكاليف إرجاع الناقل.",
            "- قد يستغرق المبلغ حتى ٣٠ يومًا ليظهر في رصيدك.",
          ],
        },
      ],
    },
    {
      title: "حسابي",
    },
    {
      title: "هل أحتاج إنشاء حساب للتسوق في كات ووك؟",
      content: [
        {
          type: "paragraph",
          text: [
            "نعم. يحب إنشاء حساب في خلال ثوان قليلة باستخدام رقم هاتفك المحمول وذلك لإتمام الطلب.",
          ],
        },
      ],
    },
    {
      title: "كيف يمكنني إنشاء حساب؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ إنشاء حساب من خلال النقر على أيقونة الحساب في الزاوية اليمنى في أعلى الصفحة.",
          ],
        },
      ],
    },
    {
      title: "كيف يمكنني تغيير معلومات الحساب؟",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنكِ تغيير تفاصيل الحساب بمجرد النقر على حسابي > تعديل معلومات الحساب",
          ],
        },
      ],
    },
    {
      title: "الدفع",
    },
    {
      title: "ما هي وسائل الدفع في كات ووك؟",
      content: [
        {
          type: "paragraph",
          text: [
            "نقبل الدفع عبر مدى، فيزا، ماستر كارد، اس تي سي باي، آبل باي، بطاقات الهدايا الإلكترونية والدفع نقدًا عند الاستلام. يرجى ملاحظة أنه من المتوقع دفع رسوم بقيمة 20 ريالاً سعوديًّا في حال الدفع نقدًا عند الاستلام.",
          ],
        },
      ],
    },

    {
      title: "كيف يمكنني اختيار عملة الدفع؟",
      content: [
        {
          type: "paragraph",
          text: [
            "جميع أسعارنا بالريال السعودي. في حال تسوقكِ خارج المملكة العربية السعودية، يرجى التأكد من فرق صرف العملة. ",
          ],
        },
      ],
    },
    {
      title: "هل الأسعار تشمل ضريبة القيمة المضافة؟",
      content: [
        {
          type: "paragraph",
          text: ["جميع أسعارنا تشمل ضريبة القيمة المضافة."],
        },
      ],
    },
    {
      title: "متى سيتم احتساب مبلغ الشراء؟",
      content: [
        {
          type: "paragraph",
          text: ["سيتم احتساب مبلغ الشراء مباشرةً عند إتمام الطلب."],
        },
      ],
    },
    {
      title: "هل يمكنني الدفع نقدًا عند الاستلام؟",
      content: [
        {
          type: "paragraph",
          text: [
            "نعم. يرجى ملاحظة أنه من المتوقع دفع رسوم بقيمة 20 ريالاً سعوديًّا في حال الدفع نقدًا عند الاستلام.",
          ],
        },
      ],
    },
  ];

  return (
    <>
      <Layout>
        <div className="container-for-content-pages border-[1px] border-[#f9f9f9]">
          <h1 className="fat text-[28px] text-center leading-[1.5] tracking-[0.5] mb-[23px]">
            الأسئلة المتكررة
          </h1>
          <div className="px-[20px] md:p-0">
            {FAQ_Content.map((value, index) => {
              return <HeadingAndText data={value} key={index} />;
            })}
          </div>
        </div>
      </Layout>
    </>
  );
}

export default FAQ;
