import React from "react";
import Layout from "../../components/rtl/layout/Layout";
import ShopByCategory from "../../components/rtl/shop-by-category/ShopByCateg";
import TextImgSection from "../../components/rtl/text-img-section/TextImgSection";
import katwalkBag from "../../assets/images/designers/katwalk-bag.jpg";
import Features from "../../components/rtl/features/Features";
import HeadingAndText from "../../components/rtl/HeadingAndText/HeadingAndText";
import { useEffect } from "react";

function PrivacyPolicy() {
  useEffect(() => {
    document.querySelector("body").style.direction = "rtl";
  }, []);
  const privacyPolicyContent = [
    {
      title: "١. المقدمة",
      content: [
        {
          type: "paragraph",
          
          text: [
            "‌ب. مرحبا بك في Katwalk، منصة تسوق إلكترونية للبيع عن الغير تربط البائعين مع المشتريين وتقدم خدمات تسويقية تهدف الى خلق قيمة مضافة للمصممات السعوديات بشكل خاص والخليجيات بشكل عام كما تقدم تجربة تسوق نموذجية للمرأة العربية العصرية عبر موقعها الالكتروني  ('المنصة' ، 'katwalk'، 'نحن'، 'لدينا'،'لنا')",
            "‌ج. 'Katwalk' علامة تجارية مسجلة ومملوكة لمؤسسة منصة أزياء التجارية، سجل تجاري رقم: ٢٠٦٢٦١٧٥٩١، ورقم ضريبي رقم: 310401691200003",
            "‌د. تحكم شروط الخدمة هذه ('الشروط '، 'شروط الخدمة') استخدامك لموقعنا/تطبيقنا الموجود على  ('الخدمة' معا أو بشكل فردي) التي تديرها Katwalk. تحكم سياسة الخصوصية أيضا استخدامك لخدمتنا وتشرح كيف نقوم بجمع وحماية وكشف المعلومات التي تنتج عن استخدامك لصفحات الويب الخاصة بنا",
            "‌و. تتضمن اتفاقيتك معنا هذه الشروط وسياسة الخصوصية الخاصة بنا ('الاتفاقية'). أنت تقر بأنك قد قرأت وفهمت الاتفاقية وتوافق على الالتزام بها.",
            "‌ز. لا يجوز لك استخدام الخدمة إذا كنت لا توافق على الاتفاقية أو لا تستطيع الامتثال لها، و حتى نتمكن من محاولة إيجاد حل، الرجاء مراسلتنا عبر البريد الالكتروني customercare@katwalk.sa",
            "‌ح. تنطبق هذه الشروط على جميع الزوار والمستخدمين وغيرهم ممن يرغبون في الوصول إلى الخدمة أو استخدامها.",
          ],
        },
      ],
    },

    {
      title: "٢. الاتصالات",
      content: [
        {
          type: "paragraph",
          text: [
            "باستخدام خدمتنا، فإنك توافق على الاشتراك في النشرات الإخبارية أو المواد التسويقية أو الترويجية وغيرها من المعلومات التي قد نرسلها. ومع ذلك، يمكنك اختيار عدم تلقي أي من هذه الاتصالات أو جميعها منا باتباع رابط إلغاء الاشتراك أو عن طريق البريد الإلكتروني على: customercare@katwalk.sa",
          ],
        },
      ],
    },
    {
      title: "٣. المشتريات",
      content: [
        {
          type: "paragraph",
          text: [
            "‌أ. إذا كنت ترغب في شراء أي منتج من خلال الخدمة ('الشراء')، فقد يطلب منك تقديم معلومات معينة ذات صلة بعملية الشراء بما في ذلك على سبيل المثال لا الحصر، رقم بطاقة الائتمان الخاصة بك، وتاريخ انتهاء صلاحية بطاقتك، وعنوان السكن الخاص بك، ومعلومات الشحن الخاصة بك.",
            "‌ب. أنت تقر وتضمن ما يلي: (1) لديك الحق القانوني في استخدام أي بطاقة أو طريقة (طرق) دفع أخرى فيما يتعلق بأي عملية شراء؛ وأن (2) المعلومات مثل رقم الهاتف المحمول والاسم وعنوان البريد الإلكتروني صالحة وكذلك تفاصيل الدفع والعنوان التي تزودنا بها صحيحة وكاملة.",
            "‌ج. يجوز لنا استخدام خدمات الطرف الثالث لغرض تسهيل الدفع وإكمال عمليات الشراء والشحن. من خلال تقديم معلوماتك، فإنك تمنحنا الحق في تقديم المعلومات إلى هذه الأطراف الثالثة الخاضعة لسياسة الخصوصية الخاصة بنا.",
          ],
        },
        {
          type: "paragraph_sm",
          text: [
            "‌د. نحن نحتفظ بالحق في رفض أو إلغاء طلبك في أي وقت لأسباب تشمل على سبيل المثال لا الحصر عدم توفر المنتج أو الخدمة، أخطاء في وصف أو سعر المنتج أو الخدمة، خطأ في طلبك أو أسباب أخرى.",
          ],
        },
        {
          type: "paragraph",
          text: [
            "‌ه. نحن نحتفظ بالحق في رفض أو إلغاء طلبك في حالة الاشتباه في حدوث احتيال أو معاملة غير مصرح بها أو غير قانونية.",
          ],
        },
      ],
    },
    {
      title: "٤. المسابقات والعروض وكوبونات الخصم",
      content: [
        {
          type: "paragraph",
          text: [
            "قد تخضع أي مسابقات أو عروض ترويجية أخرى (يشار إليها مجتمعة باسم 'العروض الترويجية') التي يتم توفيرها من خلال الخدمة لقواعد منفصلة عن شروط الخدمة هذه. إذا شاركت في أي عروض ترويجية، يرجى مراجعة القواعد المعمول بها وكذلك سياسة الخصوصية الخاصة بنا. يجوز لنا استخدام البيانات لأي مسابقات أو مسابقات للإعلان عن الفائزين. لا يمكن استخدام/نقل/بيع العروض إلى أي طرف ثالث لأغراض تجارية. يمكنك استخدام عرض / خصم واحد لكل طلب.",
          ],
        },
      ],
    },
    {
      title: "(٥. الطلبات (عملية الطلب، التوفر، والتأكيد",
      content: [
        {
          type: "bulletList",
          text: [
            "‌أ. تقديم الطلب: جميع الطلبات مملوكة ومدارة ويتم بيعها من قبل البائعين لدينا.",
            "‌ب. التوفر وتأكيد الطلب: تستغرق الطلبات ما يصل إلى يوم عمل حتى يتم قبولها من قبل البائعين. بمجرد قبول الطلب / رفضه، سيتم إرسال تأكيد عبر الرسائل القصيرة أو البريد الإلكتروني أو WhatsApp",
            "‌ج. الدفع: سيتم احتساب مبلغ الشراء من بطاقتك بمجرد إتمام الطلب. من خلال تقديم الطلب، فإنك تخول الطرف الثالث لدينا، لمعالجة تفاصيل الدفع التي اخترتها للطلب.",
            "‌د. الإلغاء: لا يمكن إلغاء الطلبات إلا في حال عدم قبول الطلب أو في حال لم تتم عملية الدفع.",
            "‌ه. أنت تفوضنا بحفظ التفاصيل الخاصة بك لطلباتك القادمة على سبيل المثال لا الحصر اسمك وعناوينك ومقاساتك . ومع ذلك، لن تقوم Katwalk بحفظ أي تفاصيل دفع خاصة بك على سبيل المثال لا الحصر، رقم بطاقة الائتمان أو تاريخ انتهاء صلاحيتها.",
          ],
        },
      ],
    },
    {
      title: "٦. إرجاع الطلبات والمبالغ المستردة",
      content: [
        {
          type: "paragraph",
          text: ["‌أ. عملية إرجاع الطلبات:"],
        },
        {
          type: "bulletList",
          text: [
            "تنتظم Katwalk بأنظمة التجارة الإلكترونية في المملكة العربية السعودية.",
            " القطع الجاهزة مؤهلة للاسترجاع في غضون 7 أيام بعد استلام الطلب.",
            " يجب أن تكون القطع جديدة وغير مستخدمة وبحالتها الأصلية كما استُلِمت ومع جميع العلامات والبطاقات المرفقة إن وجدت",
            " العميل هو المسؤول عن تكاليف الناقل للاسترجاع (عدا الطلبات التالفة/غير صحيحة)",
            " سوف تسهل Katwalk عملية الإرجاع بين العميل والبائعين.",
            "إذا كنت ترغب في إرجاع طلبك الرجاء زيارة katwalk.sa/contact واختيار طريقة الاتصال المفضلة لديك، ونحن سوف نعود إليك في أقرب وقت ممكن.",
            "القطع المفصّلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك) غير قابلة للاسترجاع.",
          ],
        },
        {
          type: "paragraph",
          text: ["‌ب. الطلبات التالفة/ غير صحيحة:"],
        },
        {
          type: "bulletList",
          text: [
            "إذا كنت قد تلقيت طلبك وكان تالفًا أو غير صحيح، فسيكون طلبك مؤهلًا للاسترجاع المجاني عن طريق زيارة katwalk.sa/contact واختيار طريقة الاتصال المفضلة لديك وذلك خلال 7 أيام من استلام الطلب",
          ],
        },
        {
          type: "paragraph",
          text: ["‌ج. عملية الاسترداد:"],
        },
        {
          type: "bulletList",
          text: [
            " لن تتم معالجة المبالغ المستردة إلا بعد الفحص و الموافقة على المنتج/المنتجات التي تم إرجاعها.",
            " بالنسبة للمنتجات المسترجعة، سيتم رد مبلغ المنتج بما في ذلك ضريبة القيمة المضافة (باستثناء رسوم الدفع عند التسليم). سيكون العميل مسؤولًا عن تكاليف الناقل للاسترجاع.",
            " بالنسبة للمنتجات التالفة/غير صحيحة، سيتم رد المبلغ المدفوع بالكامل. بما في ذلك، إن وجد، رسوم الدفع عند التسليم و لن يكون العميل مسؤولًا عن تكاليف الناقل للاسترجاع.",
          ],
        },

        {
          type: "paragraph",
          text: ["‌د. المنتجات الغير قابلة للاسترجاع:"],
        },
        {
          type: "bulletList",
          text: [
            " القطع المفصّلة حسب التصميم والمقاس (منتجات تفصيل وبيسبوك) غير قابلة للاسترجاع.",
            " الإكسسوارات ، و الملابس الداخلية ، و العطور و أدوات التجميل جميعاً غير قابلة للاسترجاع",
          ],
        },
      ],
    },

    {
      title: "٧. المحتوى",
      content: [
        {
          type: "paragraph",
          text: [
            "المحتوى الموجود على أو من خلال هذه الخدمة هو ملك لـ Katwalk. لا يجوز لك توزيع أو تعديل أو نقل أو إعادة استخدام أو تنزيل أو إعادة نشر أو نسخ أو استخدام المحتوى المذكور، سواء كليًا أو جزئيًا، لأغراض تجارية أو لتحقيق مكاسب شخصية، دون الحصول على إذن كتابي مسبق صريح منا.",
          ],
        },
      ],
    },
    {
      title: "٨. الاستخدامات المحظورة",
      content: [
        {
          type: "paragraph",
          text: [
            "يمكنك استخدام الخدمة فقط لأغراض قانونية ووفقا للشروط. أنت توافق على عدم استخدام الخدمة:",
          ],
        },
        {
          type: "bulletList",
          text: [
            " بأي شكل ينتهك أي قانون أو لائحة وطنية أو دولية سارية.",
            " لغرض استغلال أو إيذاء أو محاولة استغلال أو إيذاء القاصرين بأي شكل من الأشكال من خلال تعريضهم لمحتوى غير لائق أو غير ذلك.",
            " لنقل أو شراء إرسال أي مواد إعلانية أو ترويجية، بما في ذلك أي 'بريد غير هام' أو 'رسالة متسلسلة' أو 'بريد مزعج' أو أي طلب آخر مماثل",
            " انتحال شخصية أو محاولة انتحال شخصية المنصة أو المؤسسة المالكة لـ Katwalk أو أحد موظفيها أو مستخدم آخر أو أي شخص أو كيان آخر.",
            " بأي شكل من الأشكال ينتهك حقوق الآخرين، أو بأي شكل من الأشكال غير قانوني أو مهدد أو احتيالي أو ضار، أو فيما يتعلق بأي غرض أو نشاط غير قانوني أو احتيالي أو ضار.",
            " الانخراط في أي سلوك آخر يقيد أو يمنع استخدام أي شخص أو التمتع بالخدمة، أو التي، كما حددنا، قد تضر أو تسيء إلى المنصة أو مستخدمي الخدمة أو تعرضهم للمسؤولية",
          ],
        },
      ],
    },
    {
      title: "٩. التحليلات",
      content: [
        {
          type: "paragraph",
          text: [
            " قد نستخدم مزودي خدمة من جهات خارجية لمراقبة وتحليل استخدام خدمتنا.",
          ],
        },
      ],
    },

    {
      title: "١٠. العمر",
      content: [
        {
          type: "paragraph",
          text: [
            " الخدمة مخصصة فقط للوصول والاستخدام من قبل الأفراد الذين لا يقل أعمارهم عن ثمانية عشر (18) عامًا. من خلال الوصول إلى الخدمة أو استخدامها، فإنك تضمن وتقر بأنك تبلغ من العمر ثمانية عشر (18) عامًا على الأقل وتتمتع بالسلطة الكاملة والح والقدرة على الدخول في هذه الاتفاقية والالتزام بجميع الشروط. إذا لم يكن عمرك ثمانية عشر (18) عاما على الأقل، يحظر عليك الوصول إلى الخدمة واستخدامها.",
          ],
        },
      ],
    },
    {
      title: "١١. الملكية الفكرية",
      content: [
        {
          type: "paragraph",
          text: [
            "الخدمة ومحتواها الأصلي (باستثناء المحتوى المقدم من قبل المستخدمين) والميزات والوظائف ستظل ملكاً حصرياً لـــ Katwalk والمرخصين أو البائعين. الخدمة محمية بموجب حقوق الطبع والنشر والعلامات التجارية والقوانين الأخرى. لا يجوز استخدام علاماتنا التجارية فيما يتعلق بأي منتج أو خدمة دون موافقة خطية مسبقة من Katwalk. نحن، أو البائعين عبر المنصة، لدينا كل الحق والاهتمام بالموقع وجميع المعلومات والمواد المتعلقة باستخدام موقعنا. وبذلك، أنت توافق على أنه ليس لديك الحق في استخدام أو إعادة إنتاج أو إعادة توزيع أي من ممتلكاتنا دون موافقة خطية منا.",
          ],
        },
      ],
    },
    {
      title: "١٢. المسؤولية",
      content: [
        {
          type: "paragraph",
          text: [
            "‌أ. لا يتحمل البائع أي مسؤولية من أي نوع أو يقبلها فيما يتعلق بأي تمثيل يقدمه البائع، أو نيابة عنه، إلى المشتري، أو إلى أي طرف يتصرف نيابة عنه، قبل إبرام هذا العقد في الحالات التي قدمت فيها هذه الإقرارات أو قدمت فيما يتعلق بما يلي:",
          ],
        },
        {
          type: "bulletList",
          text: [
            " مراسلات البضائع مع أي وصف أو عينة;",
            " جودة البضائع او",
            " جودة البضائع لأي غرض كان.",
          ],
        },
        {
          type: "paragraph",
          text: [
            "‌ب. لا يجوز قبول أي مسؤولية من أي نوع من قبل البائع للمشتري فيما يتعلق بأي مادة صريحة من هذا العقد عندما يتعلق هذا المصطلح بأي شكل من الأشكال ل:",
          ],
        },
        {
          type: "bulletList",
          text: [
            " مراسلات البضائع مع أي وصف;",
            " جودة البضائع لأي غرض كان؛",
            " باستثناء الحالات التي يتعامل فيها المشتري كمستهلك، فإن جميع الضمانات أو الشروط أو الشروط الأخرى المتعلقة بالغرض أو الجودة أو الحالة للبضائع، سواء كانت صريحة أو ضمنية بموجب القانون أو القانون العام أو غير ذلك مستثناة من العقد إلى أقصى حد يسمح به القانون.",
            " لتجنب الشك، لن يقبل البائع أي مطالبة بالتعويض عن الخسارة التبعية أو المالية من أي نوع مهما كان سببها.",
          ],
        },
      ],
    },
    {
      title: "١٣. الإنهاء",
      content: [
        {
          type: "bulletList",
          text: [
            "‌أ. يجوز لنا إنهاء أو تعليق حسابك ومنع الوصول إلى الخدمة على الفور، دون إشعار مسبق أو مسؤولية، وفقا لتقديرنا الخاص، لأي سبب من الأسباب وعلى سبيل المثال لا الحصر خرق الشروط والأحكام",
            "‌ب. يمكنك إلغاء حسابك عن طريق الدخول على صفحتك الخاصة في الموقع في قسم إدارة الحساب.",
            "‌ج. جميع أحكام الشروط التي بطبيعتها ينبغي أن تبقى في العقد، يجب أن تبقى في العقد ،بما في ذلك، على سبيل المثال لا الحصر، أحكام الملكية، إخلاء المسؤولية عن الضمان و التعويض",
          ],
        },
      ],
    },
    {
      title: "١٤. القانون الحاكم",
      content: [
        {
          type: "paragraph",
          text: [
            "تخضع هذه الاتفاقية وتفسر وفقاً لقانون المملكة العربية السعودية، ويخضع الطرفان بموجب هذا الاختصاص القضائي للمحاكم السعودية.",
          ],
        },
      ],
    },
    {
      title: "١٥. تغييرات في الخدمة",
      content: [
        {
          type: "paragraph",
          text: [
            "نحن نحتفظ بالحق في سحب أو تعديل خدماتنا، وأي خدمة أو مواد نقدمها عبر المنصة، وفقا لتقديرنا الخاص دون إشعار. لن نكون مسؤولين إذا كان لأي سبب من الأسباب عدم توفر كل أو أي جزء من الخدمة في أي وقت أو لأي فترة. من وقت لآخر، قد نقيد الوصول إلى بعض أجزاء الخدمة، أو الخدمة بأكملها، للمستخدمين، بما في ذلك المستخدمين المسجلين.",
          ],
        },
      ],
    },
    {
      title: "١٦. تعديلات على الشروط",
      content: [
        {
          type: "paragraph",
          text: [
            "يجوز لنا تعديل الشروط في أي وقت عن طريق نشر الشروط المعدلة على الموقع و إرسال بريد إلكتروني إلى مستخدمينا قبل أسبوع من تطبيقها. تقع على عاتقك مسؤولية مراجعة هذه الشروط بشكل دوري. استمرار استخدامك للمنصة بعد نشر الشروط المنقحة يعني أنك تقبل التغييرات وتوافق عليها. من المتوقع أن تتحقق من هذه الصفحة بشكل متكرر حتى تكون على دراية بأي تغييرات، لأنها ملزمة لك.",
          ],
        },
      ],
    },
    {
      // title: "17. Shipping and Delivery (Shipping methods, timescales, delays)",
      title: "(١٧. الشحن والتسليم (طرق الشحن، الجداول الزمنية، التأخير",
      content: [
        {
          type: "paragraph",
          text: [
            "‌أ. القطع الجاهزة تستغرق يومين للتسليم إلى الناقل و القطع المفصلة حسب التصميم والمقاس تستغرق 10-14 يوم للتسليم إلى الناقل",
            "‌ب. يتم تسليم الطلبات إلى الناقل الحصري أرامكس ويستغرق المدة التالية:",
          ],
        },
        {
          type: "table",
          tableHead: ["الموقع", "المدة الزمنية	", "تكلفة الشحن"],
          tableBody: [
            {
              rowData: [
                "	المشتري والبائع في بلد واحد",
                "2-٥ أيام عمل",
                "مجاناً",
              ],
            },

            {
              rowData: [
                "المشتري في بلد مختلف عن البائع",
                "٦-١٠ أيام عمل",
                "على المشتري",
              ],
            },
          ],
        },
        {
          type: "bulletList",
          text: [
            "‌ج. هذا الجدول مجرد تقدير زمني للتسليم، والبائعين لدينا يبذلون قصارى جهودهم لتسليم الطلبات الخاصة بك في الوقت المحدد",
            "‌د. يرجى ملاحظة أنه قد يكون هناك بعض التأخير خلال مواسم الذروة والترويج والعطلات",
            "‌ه. من المتوقع أن تدفع أي طلبات نقدية عند التسليم 20 ريال سعودي للشحن المحلي",
            "‌و. عندما يتم وضع طلبك للتسليم سيتم الاتصال بك من قبل الناقل لتأكيد موقعك والوقت. يرجى ملاحظة أن لديك فقط 3 محاولات لاستلام الطلب قبل إلغاء طلبك أو سيتم تطبيق رسوم إضافية",
          ],
        },
      ],
    },
    {
      title: "١٨. الأسعار وضريبة القيمة المضافة",
    },

    {
      title: "‌أ. طرق الدفع",
      content: [
        {
          type: "bulletList",
          text: [
            " فيزا، ماستر كارد، مدى، Apple Pay، STC pay",
            " دفع نقدي عن الاستلام (مع الرسوم)",
          ],
        },
      ],
    },
    {
      title: "‌‌ب. الأسعار",
      content: [
        {
          type: "bulletList",
          text: [
      " جميع أسعارنا شاملة لضريبة القيمة المضافة المطبقة في المملكة العربية السعودية.",  
      " يتم عرض جميع أسعارنا بالريال السعودي.",  
      " إذا كنت تتسوق خارج المملكة العربية السعودية، فأنت مسؤول عن معرفة أسعار صرف العملات المطبقة",  
      " يرجى ملاحظة أننا نبذل قصارى جهدنا لتوفير طرق دفع مريحة. إذا واجهت أي أخطاء لطلبك، يرجى زيارة katwalk.sa/contact",  
         
    ],
        },
      ],
    },
    {
      title: "‌ج. ضريبة القيمة المضافة",
      content: [
        {
          type: "bulletList",
          text: [
            " جميع أسعارنا شاملة لضريبة القيمة المضافة المطبقة في الممكلة العربية السعودية. سوف تنعكس أي تغييرات في ضريبة القيمة المضافة على الفور على أسعارنا.",
          ],
        },
      ],
    },
    {
      title: "١٩. سياسة الخصوصية",
    },
    {
      title: "‌أ. البيانات",
      content: [
        {
          type: "paragraph",
          text: [
            "عندما تقوم بالتسجيل في موقعنا، فإنك تقبل الشروط والأحكام الخاصة بنا، وتوافق على حفظ التفاصيل والمعلومات الخاصة بك في حسابك لتسهيل تجربة الخروج ولأغراض البحث والتسويق والتحسين والتطوير. لديك الخيار لإغلاق حسابك في أي وقت ولأي سبب من خلال النقر على 'إغلاق حسابي' على صفحة حسابك.",
          ],
        },
      ],
    },
    {
      title: "ب‌. تخزين المعلومات",
      content: [
        {
          type: "paragraph",
          text: [
            "على الرغم من أننا نبذل قصارى جهدنا لتأمين وحماية كافة البيانات والمعلومات الخاصة بك عن طريق منع أي محاولات غير مصرح بها، لا يمكننا ضمان الأمن الكامل. نحن لسنا مسؤولين عن أي وصول غير مصرح به إلى موقعنا. ومع ذلك، نقوم بتطبيق إجراءات صارمة وميزات أمان لمنع أي وصول غير مصرح به. بالاضافة، لن نقوم بتخزين أي معلومات دفع خاصة بك.",
          ],
        },
      ],
    },
    {
      title: "‌ج. البريد الإلكتروني",
      content: [
        {
          type: "paragraph",
          text: [
            "قد نرسل رسائل بريد إلكتروني إلى العملاء فيما يتعلق بأي أخبار أو عروض. لديك الخيار لإيقاف تلقي رسائل البريد الإلكتروني من قبلنا في أي وقت عن طريق النقر فوق إلغاء الاشتراك في نهاية أي بريد إلكتروني",
          ],
        },
      ],
    },

    {
      title: "‌د. ملفات تعريف الارتباط",
      content: [
        
        {
          type: "bulletList",
          text: [
            " نحن نستخدم ملفات تعريف الارتباط لتحسين تجربة التسوق الخاصة بك.",
            " تقوم ملفات تعريف الارتباط الخاصة بوظائف الموقع بتصفح موقعنا على الانترنت واستخدام الميزات لدينا",
            " تقوم ملفات تعريف الارتباط لتحليل الموقع بتحليل كيفية استخدام موقعنا على الانترنت",
            " تقوم ملفات تعريف الارتباط لتفضيلات العميل بحفظ تفضيلاتك، مثل اللغة والاسم الكامل وعنوان البريد الإلكتروني وتفاصيل التسليم.",
          
          ],
        },
      ],
    },
    {
      title: "٢٠. روابط لمواقع ويب أخرى ",
      content: [
        {
          type: "paragraph",
          text: [
            "‌أ. قد تحتوي خدمتنا على روابط لمواقع أو خدمات تابعة لجهات خارجية لا تملكها أو تسيطر عليها Katwalk.",
            "‌ب. لا تملك Katwalk أي سيطرة على، ولا تتحمل أي مسؤولية عن، المحتوى أو سياسات الخصوصية أو ممارسات أي مواقع ويب أو خدمات تابعة لجهات خارجية. نحن لا نضمن عروض أي من هذه الكيانات أو الأفراد أو مواقعهم الإلكترونية.",
            "‌ج. أنت تقر وتوافق على أن katwalk لن تكون مسؤولة، بشكل مباشر أو غير مباشر، عن أي ضرر أو خسارة ناجمة أو يزعم أنها ناجمة عن أو فيما يتعلق باستخدام أو الاعتماد على أي من هذه المحتويات أو السلع أو الخدمات المتاحة على أو من خلال أي من مواقع أو خدمات الطرف الثالث. ننصحك بشدة بقراءة شروط الخدمة وسياسات الخصوصية الخاصة بأي مواقع ويب أو خدمات تابعة لجهات خارجية تقوم بزيارتها",
          ],
        },
      ],
    },
    {
      title: "٢١. حقوق الطرف الثالث",
      content: [
        {
          type: "paragraph",
          text: ["أ‌. يجوز للطرف الثالث استخدام معلوماتك للأغراض التالية:"],
        },
        {
          type: "bulletList",
          text: [
            " تنفيذ طلبك أو أي خدمة مطلوبة",
            "التحقق من المعلومات المالية وإكمالها",
            "دارة حسابك",
            " ارسال بريد إلكتروني",
            " تحليل تجربة التسوق الشخصية أو أي غرض تحليلي أو إحصائي.",
            " أغراض البحث و التطوير و التسويق أو التحسين",
            " منع الوصول غير المصرح بهم وحماية حقوقك والسلامة بما في ذلك عمليات الاحتيال",
            " أي أغراض قانونية أو تنظيمية",
          ],
        },
        {
          type: "paragraph",
          text: ["ب‌. من قد نشارك المعلومات معه؟"],
        },
        {
          type: "bulletList",
          text: [
            " الممثلون والمحال إليهم",
            " أطراف ثالثة من مقدمي الخدمات مثل شركات الدفع، وخدمات الشحن، ومطوري المواقع، وتكنولوجيا المعلومات، والدراسات الاستقصائية، ورسائل البريد الإلكتروني ، والإعلان أو التسويق ، والبحث، والتنمية.",
            " مقدمي الخدمات المهنية، ومدققي الحسابات، والمستشارين الماليين، والمحامين والحكومة، أو الهيئات البلدية، والإنفاذ القانوني أو التنظيمي",
            " مستلمو بطاقات الهدايا الإلكترونية",
          ],
        },
      ],
    },
    {
      title: "٢٢. علاقة الطرفين",
      content: [
        {
          type: "paragraph",
          text: [
            "لا يجوز تفسير أي شيء وارد في هذه الشروط على أنه إنشاء أو يعني أي شراكة أو مشروع مشترك بين الطرفين ولا يعتبر أي شيء في هذه الشروط يفسر أي من الطرفين كوكيل للطرف الآخر.",
          ],
        },
      ],
    },
    {
      title: "٢٣. القوة القاهرة",
      content: [
        {
          type: "paragraph",
          text: [
            "لا تتحمل Katwalk أي مسؤولية عن أي تأخير أو فشل في أداء أي من التزاماتها إذا كان التأخير أو الفشل ناتجًا عن أحداث أو ظروف خارجة عن سيطرتها المعقولة، بما في ذلك على سبيل المثال لا الحصر الأمراض والأوبئة الخارجة عن المألوف أو الإضرابات أو الإغلاق أو الحوادث أو الحرب أو الحريق أو انهيار المصنع أو الآلات أو نقص أو عدم توفر المواد الخام من مصدر طبيعي للتوريد، ويحق لـ Katwalk تمديد معقول لالتزاماتها. إذا استمر التأخير في الوقت الذي تعتبره المنصة غير معقول، يجوز لها دون مسؤولية من جانبها، إنهاء العقد أو أي جزء منه.",
          ],
        },
      ],
    },
    {
      title: "٢٤. التنازل",
      content: [
        {
          type: "paragraph",
          text: [
            "إن فشل أي من الطرفين في فرض أي شرط أو أكثر من الشروط الواردة في هذه الاتفاقية في أي وقت أو لأي فترة لن يكون تنازلاً عنها أو عن الحق في أي وقت لاحق في إنفاذ جميع شروط هذه الاتفاقية",
          ],
        },
      ],
    },
    {
      title: "٢٥. اللغة",
      content: [
        {
          type: "paragraph",
          text: [
            "صياغة هذا العقد وجميع الوثائق ذات الصلة تمت باللغة العربية و الإنجليزية",
          ],
        },
      ],
    },
    {
      title: "٢٦. الفصل",
      content: [
        {
          type: "paragraph",
          text: [
            "إذا تم اعتبار أي بند أو حكم من هذه الشروط غير صالح أو غير قانوني أو غير قابل للتنفيذ لأي سبب من الأسباب من قبل أي محكمة ذات اختصاص قضائي، فسيتم قطع هذا الحكم وسيستمر ما تبقى من الأحكام الواردة هنا في القوة والتأثير الكامل كما لو كانت هذه الشروط قد تم الاتفاق عليها مع البند أو الحكم الغير صالح أو الغير قانوني أو الغير قابل للتنفيذ.",
          ],
        },
      ],
    },
    {
      title: "٢٧. تسوية المنازعات",
      content: [
        {
          type: "paragraph",
          text: [
            "يتم تسوية أي نزاع ينشأ عن أو فيما يتعلق بهذه الشروط والأحكام، بما في ذلك أي نزاعات تتعلق بوجودها أو صلاحيتها أو إنهائها، من قبل المحكمة العربية السعودية وفقًا لقواعد وقوانين المملكة العربية السعودية",
          ],
        },
      ],
    },
  ];

  return (
    <>
      <Layout>
        <div className="container-for-content-pages border-[1px] border-[#f9f9f9] px-[24px] pb-[25px] ">
          <h1 className="far text-[28px] text-center leading-[1.5] tracking-[0.5] mb-[23px]">
            سياسية الخصوصية والشروط والأحكام
          </h1>
          <div className="px-[20px] md:p-0">
            {privacyPolicyContent.map((value, index) => {
              return <HeadingAndText data={value} key={index} />;
            })}
          </div>
        </div>
      </Layout>
    </>
  );
}

export default PrivacyPolicy;
